EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
void GDispCharAt(UCHAR row, UCHAR col, char c)
{
    static ESOS_TASK_HANDLE handle;
    static UCHAR data1;
    
	if(col == 0)
	{
		handle = esos_GetTaskHandle(send_comm1);
		return;
	}
		
	data1 = row;

	if(data1 == KP_POUND)
		__esos_CB_WriteUINT8(handle->pst_Mailbox->pst_CBuffer,0x79);

/*
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
	ESOS_TASK_WAIT_ON_SEND_UINT82(CHAR_AT_CMD);
	ESOS_TASK_WAIT_ON_SEND_UINT82(row);
	ESOS_TASK_WAIT_ON_SEND_UINT82(col);
	ESOS_TASK_WAIT_ON_SEND_UINT82(c);
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();
*/
}
void GDispStringAt(UCHAR row, UCHAR col, char *str)
{
	int str_len = strlen(str);
	int i;
    static ESOS_TASK_HANDLE handle;
    static UCHAR data1;
    
	if(col == 0)
	{
		handle = esos_GetTaskHandle(send_comm1);
		return;
	}
		
	data1 = row;

	__esos_CB_WriteUINT8(handle->pst_Mailbox->pst_CBuffer,data1);

/*
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
	ESOS_TASK_WAIT_ON_SEND_UINT82(STRING_AT_CMD);
	ESOS_TASK_WAIT_ON_SEND_UINT82(row);
	ESOS_TASK_WAIT_ON_SEND_UINT82(col);
	ESOS_TASK_WAIT_ON_SEND_UINT82((UCHAR)str_len);
	ESOS_TASK_WAIT_ON_SEND_UINT82((UCHAR)(str_len >> 8));
	for(i = 0;i < str_len;i++)
		ESOS_TASK_WAIT_ON_SEND_UINT82(*(str + i);
		
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();
*/
}
void GDispSetCursor(UCHAR mode, UCHAR row, UCHAR col, UCHAR type)
{
/*
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
	ESOS_TASK_WAIT_ON_SEND_UINT82(SET_CURSOR_CMD);
	ESOS_TASK_WAIT_ON_SEND_UINT82(mode);
	ESOS_TASK_WAIT_ON_SEND_UINT82(row);
	ESOS_TASK_WAIT_ON_SEND_UINT82(col);
	ESOS_TASK_WAIT_ON_SEND_UINT82(type);
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();
*/
}
void GDispSetMode(UCHAR mode)
{
/*
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
	ESOS_TASK_WAIT_ON_SEND_UINT82(SET_MODE_CMD);
	ESOS_TASK_WAIT_ON_SEND_UINT82(mode);
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();
*/
}
